* TODO list comprehension

#+begin_src python :results output
lt1 = [x for x in range(3)]
lt2 = [x for x in range(3) if x > 0]
print(lt1, lt2, sep="\n")
#print(lt2)
#+end_src

#+RESULTS:
: [0, 1, 2]
: [1, 2]

* DONE lambda
CLOSED: [2024-03-02 Sat 22:06]

#+begin_src python :results output
f = lambda a, b : a + b
print(f(1, 2))
#+end_src

#+RESULTS:
: 3

* DONE print with format
CLOSED: [2024-03-02 Sat 22:30]

#+begin_src python :results output
hello, name, num = "hi", "jack", 10000
print("%s, %s with legend" % (hello, name))
print("{0}, {1} with format".format(hello, name))
print(f"{hello}, {name} with f-string")
num = 10000
print(f"{num:,}")
#+end_src

#+RESULTS:
: hi, jack with legend
: hi, jack with format
: hi, jack with f-string
: 10,000

* DONE for
CLOSED: [2024-03-02 Sat 22:37]

#+BEGIN_SRC python :results output
for i in range(0, 2):
    for j in range(0, 2):
        print(i, j)
#+END_SRC

#+RESULTS:
: 0 0
: 0 1
: 1 0
: 1 1

* DONE list

- append

#+BEGIN_SRC python :results output
  lt = [1, 2, 3, 4]
  lt.append(5)
  print(lt)
#+END_SRC

#+RESULTS:
: [1, 2, 3, 4, 5]

* DONE math
CLOSED: [2024-03-02 Sat 22:37]

#+begin_src python :results output
import math
print(round(math.pi, 2))
#+end_src

#+RESULTS:
: 3.14

* TODO def

#+begin_src python :results output
def summy(a, b):
    return a + b

print(summy(1, 2))
#+end_src

#+RESULTS:
: 3

* TODO range

#+begin_src python :results output
for i in range(1, 10):
    if i % 2 == 0:
        print(i)
#+end_src

#+RESULTS:
: 2
: 4
: 6
: 8

* DONE re
CLOSED: [2024-03-02 Sat 22:38]

#+begin_src python :results output
import re

line = "this is the line"
match = re.search('the', line)
print(match.group(0))
#+end_src

#+RESULTS:
: the

#+begin_src python :results output
import re

line = "this-is-the"
lt = line.split('-')
print(lt)
#+end_src

#+RESULTS:
: ['this', 'is', 'the']

* DONE dunder method, double under
CLOSED: [2024-03-02 Sat 00:01]

#+begin_src python :results output
class Vector:

    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __add__(self, other):
        return Vector(self.x + other.x, self.y + other.y)

    def __repr__(self):
        return f"{self.x} x {self.y}"
    
v1 = Vector(10, 20)
v2 = Vector(50, 60)

try:
    v3 = v1 + v2
except Exception as e:
    print(e)

print(v3)

#+end_src

#+RESULTS:
: 60 x 80
** class decorator

#+begin_src python :results output
  class Person:
    name: str
    age: int

  p = Person()
  p.name = 'joe'
  p.age = 32
  print(p.name, p.age)
#+end_src

#+RESULTS:
: joe 32

#+begin_src python :results output
  from dataclasses import dataclass

  @dataclass
  class Person:
    name: str
    age: int

  p = Person('meg', 34)
  print(p)
#+end_src

#+RESULTS:
: Person(name='meg', age=34)

** function decorator

#+begin_src python :results output
def pre_decor(function):

    def auth():
        print("auth called")
        function()

    return auth

def hello_world():
    print("hello, world")

pre_decor(hello_world)()
#+end_src

#+RESULTS:
: auth called
: hello, world

#+begin_src python :results output
def pre_decor(function):

    def auth():
        print("auth called")
        function()

    return auth

@pre_decor
def hello_world():
    print("hello, world")

hello_world()
#+end_src

#+RESULTS:
: auth called
: hello, world

#+begin_src python :results output
def pre_decor(function):

    def auth(*args, **kwargs):
        print("auth called")
        value = function(*args, **kwargs)
        return value
    
    return auth

@pre_decor
def hello_world(person):
    print(f"hello, {person}")

hello_world("jack")
#+end_src

#+RESULTS:
: auth called
: hello, jack

#+begin_src python :results output
def logger(func):
    def wrapper(*args, **kwargs):
        value = func(*args, **kwargs)
        with open('log.out', 'a+') as f:
            fname = func.__name__
            print(f"{fname} turn v as {value}")
            f.write(f"{fname} turn v as {value}\n")
        return value

    return wrapper

@logger
def add(x, y):
    return x + y

print(add(10, 20))
#+end_src

#+RESULTS:
: add turn v as 30
: 30
